#include <stdio.h>
#include<locale.h>

void main(void)

{
	setlocale(LC_ALL, "RUS");
	printf("\t", "Это текст");
	printf("%20s \n ", "Это текст");
	printf("%.5f\n ", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);
	printf("Умножение %d на %d равно %d\n ", 2000, 4, 2000*4);
	printf("%g разделить %e равно %f\n ", 5., 2., 5. / 2);
	printf("%d разделить %d равно %d\n ", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n ", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2);
	int N = 20, K = 38, L = 3;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идет %d минута суток\n", K);
	printf("До полуночи осталось %d часов и %d минут\n", N, K);
	printf("С 8.00 прошло %d секунд\n", L);
	printf("Текущий час  = %d/24 суток  и текущая минута = %d/60 часа\n", N,K);
	
	printf("Дано: \n %10d \n %10d \n __________ \n +%d%-7.6f\n ", 4, 333, 0, 4 / 333.); // variant9
}